yannlossouarn/mowglinext/firmware/stm32/ros_usbnode/src/ros/ros_custom/cpp_main.cpp
        if (hard_stop) {
            DRIVEMOTOR_SetSpeedSigned(0, 0);
        } else {
            DRIVEMOTOR_SetSpeedSigned(left_pwm_signed, right_pwm_signed);
        }

        /* Drive-loop telemetry (~25 Hz = every other 50 Hz cycle): commanded
         * target velocity + the signed PWM actually sent, so the host can
         * watch the velocity->PWM mapping (breakaway, PI trim) while tuning. */
        static uint8_t telem_div = 0u;
        if ((telem_div++ & 1u) == 0u) {
            const int16_t sent_l = hard_stop ? 0 : left_pwm_signed;
            const int16_t sent_r = hard_stop ? 0 : right_pwm_signed;
            pkt_drive_telem_t telem;
            telem.type              = PKT_ID_DRIVE_TELEM;
            telem.left_target_mm_s  = (int16_t)(l_target * 1000.0f);
            telem.right_target_mm_s = (int16_t)(r_target * 1000.0f);
            telem.left_pwm          = sent_l;
            telem.right_pwm         = sent_r;
            mowgli_comms_send(&telem, sizeof(telem));
        }

        // Heartbeat watchdog: if no heartbeat for HEARTBEAT_TIMEOUT_MS, emergency stop
        if (snap_heartbeat != 0 &&
            (HAL_GetTick() - snap_heartbeat) > HEARTBEAT_TIMEOUT_MS) {
            Emergency_SetState(1);
        }

        BLADEMOTOR_Set(blade_on_off, blade_direction);
    }
}

/* ---------------------------------------------------------------------------
 * Panel handler — button presses generate UI events over COBS
 * ---------------------------------------------------------------------------*/
extern "C" void panel_handler()
{
    if (NBT_handler(&panel_nbt)) {
        PANEL_Tick();

        if (buttonupdated == 1 && buttoncleared == 0) {
            pkt_ui_event_t evt;
            evt.type = PKT_ID_UI_EVENT;
            evt.press_duration = 0;  // short press

            // Map physical buttons to IDs
            if (buttonstate[PANEL_BUTTON_DEF_S1]) {
                evt.button_id = 1;
                mowgli_comms_send(&evt, sizeof(evt));
            }
            if (buttonstate[PANEL_BUTTON_DEF_S2]) {
                evt.button_id = 2;
                mowgli_comms_send(&evt, sizeof(evt));
            }
            if (buttonstate[PANEL_BUTTON_DEF_LOCK]) {
                evt.button_id = 3;
                mowgli_comms_send(&evt, sizeof(evt));
            }
            if (buttonstate[PANEL_BUTTON_DEF_START]) {
                evt.button_id = 4;
                mowgli_comms_send(&evt, sizeof(evt));
            }
            if (buttonstate[PANEL_BUTTON_DEF_HOME]) {
                evt.button_id = 5;
                mowgli_comms_send(&evt, sizeof(evt));
            }

            buttonupdated = 0;
        }
    }
}

#if OPTION_ULTRASONIC == 1
extern "C" void ultrasonic_handler(void)
{
    // USS data is included in the status packet — no separate packet needed.
    // This handler is kept for the main loop call in main.c.
}
#endif

/* ---------------------------------------------------------------------------
 * Wheel ticks handler — called from DRIVEMOTOR_App_Rx() every 20 ms.
 *
 * Builds the odometry packet from signed cumulative ticks. Per-wheel
 * velocity is computed here (not on the Pi) because the firmware has the
 * hardware-timer-accurate dt. All four quantities in the packet are
 * signed; the host doesn't need a direction byte or to re-sign anything.
 * ---------------------------------------------------------------------------*/
extern "C" void wheelTicks_handler(
    int32_t  p_s32LeftTicksSigned,
    int32_t  p_s32RightTicksSigned,
    int16_t  p_s16LeftSpeed,   /* currently unused — reserved for future telemetry */
    int16_t  p_s16RightSpeed)
{
    (void)p_s16LeftSpeed;
    (void)p_s16RightSpeed;

    static int32_t prev_left_ticks  = 0;
    static int32_t prev_right_ticks = 0;

    const uint32_t now_tick = HAL_GetTick();
    const uint16_t dt_ms    = (uint16_t)(now_tick - last_odom_tick);
    last_odom_tick = now_tick;

    const int32_t delta_left  = p_s32LeftTicksSigned  - prev_left_ticks;
    const int32_t delta_right = p_s32RightTicksSigned - prev_right_ticks;
    prev_left_ticks  = p_s32LeftTicksSigned;
    prev_right_ticks = p_s32RightTicksSigned;

    /* Velocity: mm/s = (delta_ticks / TICKS_PER_M) * (1000 / dt_ms) * 1000
     *                = delta_ticks * 1e6 / (TICKS_PER_M * dt_ms).
     * TICKS_PER_M is 300, so the constant numerator (300 * dt_ms) stays
     * comfortably inside int32 for any realistic dt. We still cast to
     * int64 for the mul to be safe on large tick deltas.                  */
    int16_t left_v_mm_s  = 0;
    int16_t right_v_mm_s = 0;
    if (dt_ms > 0)
    {
        const int64_t denom = (int64_t)TICKS_PER_M * (int64_t)dt_ms;
        int64_t v_l = ((int64_t)delta_left  * 1000000LL) / denom;
        int64_t v_r = ((int64_t)delta_right * 1000000LL) / denom;
        if (v_l >  32767) v_l =  32767;
        if (v_l < -32768) v_l = -32768;
        if (v_r >  32767) v_r =  32767;
        if (v_r < -32768) v_r = -32768;
        left_v_mm_s  = (int16_t)v_l;
        right_v_mm_s = (int16_t)v_r;
    }

    pkt_odometry_t odom;
    odom.type                 = PKT_ID_ODOMETRY;
    odom.dt_millis            = dt_ms;
    odom.left_ticks           = p_s32LeftTicksSigned;
    odom.right_ticks          = p_s32RightTicksSigned;
    odom.left_velocity_mm_s   = left_v_mm_s;
    odom.right_velocity_mm_s  = right_v_mm_s;

    mowgli_comms_send_odometry(&odom);
}

/* ---------------------------------------------------------------------------
 * IMU + status broadcast handler
 * ---------------------------------------------------------------------------*/
extern "C" void broadcast_handler()
{
    if (NBT_handler(&imu_nbt)) {
        pkt_imu_t imu_pkt;
        imu_pkt.type = PKT_ID_IMU;

        static uint32_t last_imu_tick = 0;
        uint32_t now_tick = HAL_GetTick();
        imu_pkt.dt_millis = (uint16_t)(now_tick - last_imu_tick);
        last_imu_tick = now_tick;

#ifdef EXTERNAL_IMU_ACCELERATION
        float ax, ay, az;
        IMU_ReadAccelerometer(&ax, &ay, &az);
        imu_pkt.acceleration_mss[0] = ax;
        imu_pkt.acceleration_mss[1] = ay;
        imu_pkt.acceleration_mss[2] = az;
#else
        imu_pkt.acceleration_mss[0] = 0.0f;
        imu_pkt.acceleration_mss[1] = 0.0f;
        imu_pkt.acceleration_mss[2] = 0.0f;
#endif

#ifdef EXTERNAL_IMU_ANGULAR
        float gx, gy, gz;
        IMU_ReadGyro(&gx, &gy, &gz);
        imu_pkt.gyro_rads[0] = gx;
        imu_pkt.gyro_rads[1] = gy;
        imu_pkt.gyro_rads[2] = gz;
#else
        imu_pkt.gyro_rads[0] = 0.0f;
        imu_pkt.gyro_rads[1] = 0.0f;
        imu_pkt.gyro_rads[2] = 0.0f;
#endif

        // Magnetometer — uses generic IMU_ReadMag (works with any IMU that has mag)
        IMU_ReadMag(&imu_pkt.mag_uT[0], &imu_pkt.mag_uT[1], &imu_pkt.mag_uT[2]);

        mowgli_comms_send_imu(&imu_pkt);
    }

    if (NBT_handler(&status_nbt)) {
        pkt_status_t status_pkt;
        status_pkt.type = PKT_ID_STATUS;

